# Análise dos Dados Consolidado

In [2]:
import pandas as pd

## Carregando os dados da planilha consolidada

In [4]:
df = pd.read_excel("data/Relatorio_05-2024.xlsx")

In [6]:
# Visualizar os primeiros valores do dataframe
df.head()

,Tipo,Cidade,Produto,Qtde de Unidades Vendidas,Preço Unitário,Valor Total,Desconto,Valor Total c/ Desconto,Custo Total,Lucro,Data,Mês,Ano
0,Governo,Beira,Produto 1,1618.5,20,32370.0,0.0,32370.0,17803.5,14566.5,2019-01-01,Janeiro,2019
1,Governo,Beira,Produto 3,292.0,20,5840.0,0.0,5840.0,2920.0,2920.0,2019-02-01,Fevereiro,2019
2,Governo,Beira,Produto 3,1725.0,350,603750.0,0.0,603750.0,448500.0,155250.0,2018-11-01,Novembro,2018
3,Governo,Beira,Produto 3,1817.0,20,36340.0,0.0,36340.0,18170.0,18170.0,2019-12-01,Dezembro,2019
4,Governo,Beira,Produto 5,1817.0,20,36340.0,0.0,36340.0,18170.0,18170.0,2019-12-01,Dezembro,2019

In [7]:
# Visualizar os ultimos valores do dataframe
df.tail()

,Tipo,Cidade,Produto,Qtde de Unidades Vendidas,Preço Unitário,Valor Total,Desconto,Valor Total c/ Desconto,Custo Total,Lucro,Data,Mês,Ano
695,Vendas online,Pemba,Produto 3,2914.0,12,34968.0,4895.52,30072.48,8742.0,21330.48,2019-10-01,Outubro,2019
696,Vendas online,Pemba,Produto 6,2914.0,12,34968.0,4895.52,30072.48,8742.0,21330.48,2019-10-01,Outubro,2019
697,Vendas online,Pemba,Produto 3,914.0,12,10968.0,1645.20,9322.80,2742.0,6580.80,2019-12-01,Dezembro,2019
698,Vendas online,Pemba,Produto 4,914.0,12,10968.0,1645.20,9322.80,2742.0,6580.80,2019-12-01,Dezembro,2019
699,Vendas online,Pemba,Produto 5,1806.0,12,21672.0,3250.80,18421.20,5418.0,13003.20,2019-05-01,Maio,2019

In [20]:
# numero de linhas e colunas
df.shape

(700, 13)

## Verificando o tipo de dados das colunas do DataFrame

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Tipo                       700 non-null    object
 1   Cidade                     700 non-null    object
 2   Produto                    700 non-null    object
 3   Qtde de Unidades Vendidas  700 non-null    float64
 4   Preço Unitário             700 non-null    int64
 5   Valor Total                700 non-null    float64
 6   Desconto                   700 non-null    float64
 7   Valor Total c/ Desconto    700 non-null    float64
 8   Custo Total                700 non-null    float64
 9   Lucro                      700 non-null    float64
 10  Data                       700 non-null    datetime64[ns]
 11  Mês                        700 non-null    object
 12  Ano                        700 non-null    int64
dtypes: datetime64[ns](1), float64(6), int64(2), object(4)
memory usage: 71.2+ KB

## Acessando Colunas individualmente

In [10]:
df.head()

,Tipo,Cidade,Produto,Qtde de Unidades Vendidas,Preço Unitário,Valor Total,Desconto,Valor Total c/ Desconto,Custo Total,Lucro,Data,Mês,Ano
0,Governo,Beira,Produto 1,1618.5,20,32370.0,0.0,32370.0,17803.5,14566.5,2019-01-01,Janeiro,2019
1,Governo,Beira,Produto 3,292.0,20,5840.0,0.0,5840.0,2920.0,2920.0,2019-02-01,Fevereiro,2019
2,Governo,Beira,Produto 3,1725.0,350,603750.0,0.0,603750.0,448500.0,155250.0,2018-11-01,Novembro,2018
3,Governo,Beira,Produto 3,1817.0,20,36340.0,0.0,36340.0,18170.0,18170.0,2019-12-01,Dezembro,2019
4,Governo,Beira,Produto 5,1817.0,20,36340.0,0.0,36340.0,18170.0,18170.0,2019-12-01,Dezembro,2019

In [15]:
# Coluna Tipo
df['Tipo']

0            Governo
1            Governo
2            Governo
3            Governo
4            Governo
           ...
695    Vendas online
696    Vendas online
697    Vendas online
698    Vendas online
699    Vendas online
Name: Tipo, Length: 700, dtype: object

In [16]:
# Coluna Produto
df['Produto']

0      Produto 1
1      Produto 3
2      Produto 3
3      Produto 3
4      Produto 5
         ...
695    Produto 3
696    Produto 6
697    Produto 3
698    Produto 4
699    Produto 5
Name: Produto, Length: 700, dtype: object

In [18]:
df.Desconto

0         0.00
1         0.00
2         0.00
3         0.00
4         0.00
        ...
695    4895.52
696    4895.52
697    1645.20
698    1645.20
699    3250.80
Name: Desconto, Length: 700, dtype: float64

## Alterando o nome das colunas do DataFrame

In [27]:
colunas = ['tipo', 'cidade', 'produto', 'qtd_unidades_vendidas', 'preco_unitario', 'valor_total', 'desconto',
           'valor_total_desconto', 'custo_total', 'lucro', 'data', 'mes', 'ano']

In [29]:
df.columns

Index(['Tipo', 'Cidade', 'Produto', 'Qtde de Unidades Vendidas',
       'Preço Unitário', 'Valor Total', 'Desconto', 'Valor Total c/ Desconto',
       'Custo Total', 'Lucro', 'Data', 'Mês', 'Ano'],
      dtype='object')

In [30]:
df.columns = colunas

In [31]:
df.columns

Index(['tipo', 'cidade', 'produto', 'qtd_unidades_vendidas', 'preco_unitario',
       'valor_total', 'desconto', 'valor_total_desconto', 'custo_total',
       'lucro', 'data', 'mes', 'ano'],
      dtype='object')

In [32]:
df.tipo

0            Governo
1            Governo
2            Governo
3            Governo
4            Governo
           ...
695    Vendas online
696    Vendas online
697    Vendas online
698    Vendas online
699    Vendas online
Name: tipo, Length: 700, dtype: object

In [33]:
df.produto

0      Produto 1
1      Produto 3
2      Produto 3
3      Produto 3
4      Produto 5
         ...
695    Produto 3
696    Produto 6
697    Produto 3
698    Produto 4
699    Produto 5
Name: produto, Length: 700, dtype: object

## Contagem de Registros

In [34]:
# Quantos registros temos de cada tipo de cliente?
df.tipo.value_counts()              # df['tipo'].value_counts()

tipo
Governo              300
Grandes empresas     100
Médias empresas      100
Pequenas empresas    100
Vendas online        100
Name: count, dtype: int64

In [37]:
# Quantos registros temos para cada produto?
df.produto.value_counts()

produto
Produto 3    202
Produto 5    109
Produto 4    109
Produto 6     94
Produto 1     93
Produto 2     93
Name: count, dtype: int64

In [39]:
# Quantas ocorrencias temos para cada cidade?
df.cidade.value_counts()

cidade
Beira        140
Inhambane    140
Maputo       140
Nacala       140
Pemba        140
Name: count, dtype: int64

## Análises Monetárias

In [42]:
# Contagem, Medias, minimo, Primeiro Quartil, Segundo Quartil (mediana), Terceiro Quartil, Maximo, desvio padrao,
df.describe().round(2)

,qtd_unidades_vendidas,preco_unitario,valor_total,desconto,valor_total_desconto,custo_total,lucro,data,ano
count,700.00,700.00,700.00,700.00,700.00,700.00,700.00,700,700.00
mean,1608.29,118.43,182759.43,13150.35,169609.07,147187.85,22421.22,2019-04-28 21:36:00,2018.75
min,200.00,7.00,1799.00,0.00,1655.08,918.00,-71250.25,2018-09-01 00:00:00,2018.00
25%,905.00,12.00,17391.75,800.32,15928.00,7538.00,2701.80,2018-12-24 06:00:00,2018.75
50%,1542.50,20.00,37980.00,2585.25,35540.20,22580.00,8936.40,2019-05-16 12:00:00,2019.00
75%,2229.12,300.00,279025.00,15956.34,261077.50,248422.50,21155.74,2019-09-08 12:00:00,2019.00
max,4492.50,350.00,1207500.00,149677.50,1159200.00,950625.00,262200.00,2019-12-01 00:00:00,2019.00
std,867.43,136.78,254262.28,22962.93,236726.35,205930.04,42282.73,NaN,0.43

### Perguntas que a linha anterior pode responder?
1. Qual é o valor médio do valor total das vendas?
2. Qual é o média dos descontos?
3. Qual é o minimo preço aplicada na empresa?
4. Qual é o menor desconto aplicado na empresa?
5. Qual é o menor lucro? **Aqui podemos perceber que o lucro é negativo, entao podemos concluir que houve prejuizo**
6. Qual é o maior preço aplicado na empresa?
7. Qual é o maior desconto aplicado na empresa?
8. Qual foi o maior lucro?

## Análises por Agrupamento de Dados

In [47]:
# Agrupamento de valores maximos por grupo de tipo de empresa
df.groupby('tipo').max()

,cidade,produto,qtd_unidades_vendidas,preco_unitario,valor_total,desconto,valor_total_desconto,custo_total,lucro,data,mes,ano
tipo,,,,,,,,,,,,
Governo,Pemba,Produto 6,4492.5,350,1207500.0,149677.500,1159200.00,897000.0,262200.00,2019-12-01,Setembro,2019
Grandes empresas,Pemba,Produto 6,4243.5,125,530437.5,55387.500,527437.50,560142.0,21097.50,2019-12-01,Setembro,2019
Médias empresas,Pemba,Produto 6,3997.5,15,59962.5,7795.125,53594.10,39975.0,15584.10,2019-12-01,Setembro,2019
Pequenas empresas,Pemba,Produto 6,3802.5,300,1140750.0,125820.000,1038082.50,950625.0,136535.00,2019-12-01,Setembro,2019
Vendas online,Pemba,Produto 6,4026.0,12,48312.0,5314.320,42997.68,12078.0,30919.68,2019-12-01,Setembro,2019

In [68]:
# Agrupamento por cidade
colunas = ['valor_total_desconto', 'custo_total', 'lucro']
df_cidade = df.groupby('cidade')[colunas].sum().round(2)
df_cidade

           valor_total_desconto  custo_total       lucro
cidade
Beira               24678785.66   21407108.9  3271676.76
Inhambane           20582300.16   18229519.3  2352780.86
Maputo              23715132.47   20241678.6  3473453.87
Nacala              21314563.36   18549101.7  2765461.66
Pemba               28435568.60   24604089.8  3831478.80

In [66]:
# Agrupamento por tipo de cliente
colunas = ['valor_total_desconto', 'custo_total', 'lucro']
df_tipo =df.groupby('tipo')[colunas].sum().round(2)
df_tipo

                   valor_total_desconto  custo_total        lucro
tipo
Governo                     52504260.67   41584282.5  10919978.17
Grandes empresas            19611694.38   20568882.0   -957187.63
Médias empresas              2381883.08    1746100.0    635783.07
Pequenas empresas           42427918.50   38641000.0   3786918.50
Vendas online                1800593.64     491233.8   1309359.84

In [67]:
# Agrupamento por produto
colunas = ['valor_total_desconto', 'custo_total', 'lucro']
df_produto =df.groupby('produto')[colunas].sum().round(2)
df_produto

           valor_total_desconto  custo_total       lucro
produto
Produto 1           13815307.88   13187353.3   627954.58
Produto 2           15390801.88   13276047.0  2114754.88
Produto 3           33011143.95   28213706.0  4797437.95
Produto 4           18250059.46   15944067.0  2305992.46
Produto 5           20511921.02   17477313.0  3034608.02
Produto 6           17747116.06   14933012.0  2814104.06